---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.Dispose
source: html/f04e4d12-a13b-8c66-824e-56240c24075d.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem.Dispose Method

Releases all resources used by the DuctFittingAndAccessoryPressureDropItem

## Syntax (C#)
```csharp
public void Dispose()
```